zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_unicommuart.h
/* UNICOMMUART_CPU_INT_RIS Bits */
/* UNICOMMUART_CPU_INT_RIS[RTOUT] Bits */
#define UNICOMMUART_CPU_INT_RIS_RTOUT_OFS        (0)                             /* !< RTOUT Offset */
#define UNICOMMUART_CPU_INT_RIS_RTOUT_MASK       ((uint32_t)0x00000001U)         /* !< UARTOUT Receive Time-Out Interrupt.
                                                                                    Interupt is raised when a time-out
                                                                                    has lapsed and there are still items
                                                                                    in the FIFO */
#define UNICOMMUART_CPU_INT_RIS_RTOUT_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_RIS_RTOUT_SET        ((uint32_t)0x00000001U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_RIS[FRMERR] Bits */
#define UNICOMMUART_CPU_INT_RIS_FRMERR_OFS       (1)                             /* !< FRMERR Offset */
#define UNICOMMUART_CPU_INT_RIS_FRMERR_MASK      ((uint32_t)0x00000002U)         /* !< UART Framing Error Interrupt.
                                                                                    Framing error interrupt is raised
                                                                                    when a "low" stop bit is detected. */
#define UNICOMMUART_CPU_INT_RIS_FRMERR_CLR       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_RIS_FRMERR_SET       ((uint32_t)0x00000002U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_RIS[PARERR] Bits */
#define UNICOMMUART_CPU_INT_RIS_PARERR_OFS       (2)                             /* !< PARERR Offset */
#define UNICOMMUART_CPU_INT_RIS_PARERR_MASK      ((uint32_t)0x00000004U)         /* !< UART Parity Error Interrupt. */
#define UNICOMMUART_CPU_INT_RIS_PARERR_CLR       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_RIS_PARERR_SET       ((uint32_t)0x00000004U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_RIS[BRKERR] Bits */
#define UNICOMMUART_CPU_INT_RIS_BRKERR_OFS       (3)                             /* !< BRKERR Offset */
#define UNICOMMUART_CPU_INT_RIS_BRKERR_MASK      ((uint32_t)0x00000008U)         /* !< UART Break Error Interrupt.   Break
                                                                                    Error Interrupt is raised when all
                                                                                    data bits, parity bit and stop bits
                                                                                    are '0' */
#define UNICOMMUART_CPU_INT_RIS_BRKERR_CLR       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_RIS_BRKERR_SET       ((uint32_t)0x00000008U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_RIS[OVRERR] Bits */
#define UNICOMMUART_CPU_INT_RIS_OVRERR_OFS       (4)                             /* !< OVRERR Offset */
#define UNICOMMUART_CPU_INT_RIS_OVRERR_MASK      ((uint32_t)0x00000010U)         /* !< UART Receive Overrun Error
                                                                                    Interrupt.   UART Receive Overrun
                                                                                    Error Interrupt is raised when the
                                                                                    receive FIFO is flow and a new frame
                                                                                    is received */
#define UNICOMMUART_CPU_INT_RIS_OVRERR_CLR       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_RIS_OVRERR_SET       ((uint32_t)0x00000010U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_RIS[RXNE] Bits */
#define UNICOMMUART_CPU_INT_RIS_RXNE_OFS         (5)                             /* !< RXNE Offset */
#define UNICOMMUART_CPU_INT_RIS_RXNE_MASK        ((uint32_t)0x00000020U)         /* !< Negative Edge on UARTxRXD
                                                                                    Interrupt. */
#define UNICOMMUART_CPU_INT_RIS_RXNE_CLR         ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_RIS_RXNE_SET         ((uint32_t)0x00000020U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_RIS[RXPE] Bits */
#define UNICOMMUART_CPU_INT_RIS_RXPE_OFS         (6)                             /* !< RXPE Offset */
#define UNICOMMUART_CPU_INT_RIS_RXPE_MASK        ((uint32_t)0x00000040U)         /* !< Positive Edge on UARTxRXD
                                                                                    Interrupt. */
#define UNICOMMUART_CPU_INT_RIS_RXPE_CLR         ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_RIS_RXPE_SET         ((uint32_t)0x00000040U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_RIS[LINC0] Bits */
#define UNICOMMUART_CPU_INT_RIS_LINC0_OFS        (7)                             /* !< LINC0 Offset */
#define UNICOMMUART_CPU_INT_RIS_LINC0_MASK       ((uint32_t)0x00000080U)         /* !< LIN Capture 0 / Match Interrupt . */
#define UNICOMMUART_CPU_INT_RIS_LINC0_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_RIS_LINC0_SET        ((uint32_t)0x00000080U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_RIS[LINC1] Bits */
#define UNICOMMUART_CPU_INT_RIS_LINC1_OFS        (8)                             /* !< LINC1 Offset */
#define UNICOMMUART_CPU_INT_RIS_LINC1_MASK       ((uint32_t)0x00000100U)         /* !< LIN Capture 1 Interrupt. */
#define UNICOMMUART_CPU_INT_RIS_LINC1_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_RIS_LINC1_SET        ((uint32_t)0x00000100U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_RIS[LINOVF] Bits */
#define UNICOMMUART_CPU_INT_RIS_LINOVF_OFS       (9)                             /* !< LINOVF Offset */
#define UNICOMMUART_CPU_INT_RIS_LINOVF_MASK      ((uint32_t)0x00000200U)         /* !< LIN Hardware Counter Overflow
                                                                                    Interrupt. */
#define UNICOMMUART_CPU_INT_RIS_LINOVF_CLR       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_RIS_LINOVF_SET       ((uint32_t)0x00000200U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_RIS[RXINT] Bits */
#define UNICOMMUART_CPU_INT_RIS_RXINT_OFS        (10)                            /* !< RXINT Offset */
#define UNICOMMUART_CPU_INT_RIS_RXINT_MASK       ((uint32_t)0x00000400U)         /* !< UART Receive Interrupt. */
#define UNICOMMUART_CPU_INT_RIS_RXINT_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_RIS_RXINT_SET        ((uint32_t)0x00000400U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_RIS[TXINT] Bits */
#define UNICOMMUART_CPU_INT_RIS_TXINT_OFS        (11)                            /* !< TXINT Offset */
#define UNICOMMUART_CPU_INT_RIS_TXINT_MASK       ((uint32_t)0x00000800U)         /* !< UART Transmit Interrupt. */
#define UNICOMMUART_CPU_INT_RIS_TXINT_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_RIS_TXINT_SET        ((uint32_t)0x00000800U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_RIS[EOT] Bits */
#define UNICOMMUART_CPU_INT_RIS_EOT_OFS          (12)                            /* !< EOT Offset */
#define UNICOMMUART_CPU_INT_RIS_EOT_MASK         ((uint32_t)0x00001000U)         /* !< UART End of Transmission Interrupt
                                                                                    Indicates that the last bit of all
                                                                                    transmitted data and flags has left
                                                                                    the serializer and without any
                                                                                    further Data in the TX Fifo or
                                                                                    Buffer. */
#define UNICOMMUART_CPU_INT_RIS_EOT_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_RIS_EOT_SET          ((uint32_t)0x00001000U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_RIS[ADDR_MATCH] Bits */
#define UNICOMMUART_CPU_INT_RIS_ADDR_MATCH_OFS   (13)                            /* !< ADDR_MATCH Offset */
#define UNICOMMUART_CPU_INT_RIS_ADDR_MATCH_MASK  ((uint32_t)0x00002000U)         /* !< Address Match Interrupt. */
#define UNICOMMUART_CPU_INT_RIS_ADDR_MATCH_CLR   ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_RIS_ADDR_MATCH_SET   ((uint32_t)0x00002000U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_RIS[CTS] Bits */
#define UNICOMMUART_CPU_INT_RIS_CTS_OFS          (14)                            /* !< CTS Offset */
#define UNICOMMUART_CPU_INT_RIS_CTS_MASK         ((uint32_t)0x00004000U)         /* !< UART Clear to Send Modem Interrupt.
                                                                                    This interrupt is raised when CTS
                                                                                    toggles, either from '0' to '1' or
                                                                                    from '1' to '0'. */
#define UNICOMMUART_CPU_INT_RIS_CTS_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMUART_CPU_INT_RIS_CTS_SET          ((uint32_t)0x00004000U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_RIS[DMA_DONE_RX] Bits */
#define UNICOMMUART_CPU_INT_RIS_DMA_DONE_RX_OFS  (15)                            /* !< DMA_DONE_RX Offset */
#define UNICOMMUART_CPU_INT_RIS_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< DMA Done on RX Event Channel
                                                                                    Interrupt */
#define UNICOMMUART_CPU_INT_RIS_DMA_DONE_RX_CLR  ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMUART_CPU_INT_RIS_DMA_DONE_RX_SET  ((uint32_t)0x00008000U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_RIS[DMA_DONE_TX] Bits */
#define UNICOMMUART_CPU_INT_RIS_DMA_DONE_TX_OFS  (16)                            /* !< DMA_DONE_TX Offset */
#define UNICOMMUART_CPU_INT_RIS_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< DMA Done on TX Event Channel
                                                                                    Interrupt */
#define UNICOMMUART_CPU_INT_RIS_DMA_DONE_TX_CLR  ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMUART_CPU_INT_RIS_DMA_DONE_TX_SET  ((uint32_t)0x00010000U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_RIS[NERR] Bits */
#define UNICOMMUART_CPU_INT_RIS_NERR_OFS         (17)                            /* !< NERR Offset */
#define UNICOMMUART_CPU_INT_RIS_NERR_MASK        ((uint32_t)0x00020000U)         /* !< Noise Error on triple voting.
                                                                                    Asserted when the 3 samples of
                                                                                    majority voting are not equal */
#define UNICOMMUART_CPU_INT_RIS_NERR_CLR         ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_RIS_NERR_SET         ((uint32_t)0x00020000U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_RIS[DMA_PREIRQ_RX] Bits */
#define UNICOMMUART_CPU_INT_RIS_DMA_PREIRQ_RX_OFS (18)                            /* !< DMA_PREIRQ_RX Offset */
#define UNICOMMUART_CPU_INT_RIS_DMA_PREIRQ_RX_MASK ((uint32_t)0x00040000U)         /* !< DMA Pre-emptive Interrupt Done on
                                                                                    RX Event Channel Interrupt */
#define UNICOMMUART_CPU_INT_RIS_DMA_PREIRQ_RX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMUART_CPU_INT_RIS_DMA_PREIRQ_RX_SET ((uint32_t)0x00040000U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_RIS[DMA_PREIRQ_TX] Bits */
#define UNICOMMUART_CPU_INT_RIS_DMA_PREIRQ_TX_OFS (19)                            /* !< DMA_PREIRQ_TX Offset */
#define UNICOMMUART_CPU_INT_RIS_DMA_PREIRQ_TX_MASK ((uint32_t)0x00080000U)         /* !< DMA Pre-Emptive Done on TX Event
                                                                                    Channel Interrupt */
#define UNICOMMUART_CPU_INT_RIS_DMA_PREIRQ_TX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMUART_CPU_INT_RIS_DMA_PREIRQ_TX_SET ((uint32_t)0x00080000U)         /* !< Interrupt occurred */
/* UNICOMMUART_CPU_INT_RIS[LTOUT] Bits */
#define UNICOMMUART_CPU_INT_RIS_LTOUT_OFS        (20)                            /* !< LTOUT Offset */
#define UNICOMMUART_CPU_INT_RIS_LTOUT_MASK       ((uint32_t)0x00100000U)         /* !< UARTOUT Line Time-Out Interrupt.
                                                                                    Set: no start edge has been detected
                                                                                    for an additional character period
                                                                                    after reception of last character.
                                                                                    This is irrespective of FIFO contents
                                                                                    Clear: timeout has not occured */
#define UNICOMMUART_CPU_INT_RIS_LTOUT_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UNICOMMUART_CPU_INT_RIS_LTOUT_SET        ((uint32_t)0x00100000U)         /* !< Interrupt occurred */

