zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_unicommuart.h
/* UNICOMMUART_STAT Bits */
/* UNICOMMUART_STAT[BUSY] Bits */
#define UNICOMMUART_STAT_BUSY_OFS                (0)                             /* !< BUSY Offset */
#define UNICOMMUART_STAT_BUSY_MASK               ((uint32_t)0x00000001U)         /* !< UART Busy 			This bit is set as
                                                                                    soon as the transmit FIFO/buffer
                                                                                    becomes non-empty (regardless of
                                                                                    whether UART is enabled) or if a
                                                                                    receive data is currently ongoing
                                                                                    (after the start edge have been
                                                                                    detected until a complete byte,
                                                                                    including all stop bits, has been
                                                                                    received by the shift register). In
                                                                                    IDLE_Line mode the Busy signal also
                                                                                    stays set during the idle time
                                                                                    generation. */
#define UNICOMMUART_STAT_BUSY_CLEARED            ((uint32_t)0x00000000U)         /* !< The UART is not busy. */
#define UNICOMMUART_STAT_BUSY_SET                ((uint32_t)0x00000001U)         /* !< The UART is busy transmitting data.
                                                                                    This bit remains set until the
                                                                                    complete byte, including all stop
                                                                                    bits, has been sent/received
                                                                                    from/into the shift register. */
/* UNICOMMUART_STAT[TXFF] Bits */
#define UNICOMMUART_STAT_TXFF_OFS                (6)                             /* !< TXFF Offset */
#define UNICOMMUART_STAT_TXFF_MASK               ((uint32_t)0x00000040U)         /* !< UART Transmit FIFO Full  The
                                                                                    meaning of this bit depends on the
                                                                                    state of the FEN bit in the CTL0
                                                                                    register. */
#define UNICOMMUART_STAT_TXFF_CLEARED            ((uint32_t)0x00000000U)         /* !< The transmitter is not full. */
#define UNICOMMUART_STAT_TXFF_SET                ((uint32_t)0x00000040U)         /* !< transmit FIFO is full. */
/* UNICOMMUART_STAT[RXFF] Bits */
#define UNICOMMUART_STAT_RXFF_OFS                (3)                             /* !< RXFF Offset */
#define UNICOMMUART_STAT_RXFF_MASK               ((uint32_t)0x00000008U)         /* !< UART Receive FIFO Full */
#define UNICOMMUART_STAT_RXFF_CLEARED            ((uint32_t)0x00000000U)         /* !< The receiver can receive data. */
#define UNICOMMUART_STAT_RXFF_SET                ((uint32_t)0x00000008U)         /* !< receive FIFO is full. */
/* UNICOMMUART_STAT[TXFE] Bits */
#define UNICOMMUART_STAT_TXFE_OFS                (5)                             /* !< TXFE Offset */
#define UNICOMMUART_STAT_TXFE_MASK               ((uint32_t)0x00000020U)         /* !< UART Transmit FIFO Empty */
#define UNICOMMUART_STAT_TXFE_CLEARED            ((uint32_t)0x00000000U)         /* !< The transmitter has data to
                                                                                    transmit. */
#define UNICOMMUART_STAT_TXFE_SET                ((uint32_t)0x00000020U)         /* !< transmit FIFO is empty. */
/* UNICOMMUART_STAT[CTS] Bits */
#define UNICOMMUART_STAT_CTS_OFS                 (8)                             /* !< CTS Offset */
#define UNICOMMUART_STAT_CTS_MASK                ((uint32_t)0x00000100U)         /* !< Clear To Send */
#define UNICOMMUART_STAT_CTS_CLEARED             ((uint32_t)0x00000000U)         /* !< The CTS signal is not asserted
                                                                                    (high). */
#define UNICOMMUART_STAT_CTS_SET                 ((uint32_t)0x00000100U)         /* !< The CTS signal is asserted (low). */
/* UNICOMMUART_STAT[IDLE] Bits */
#define UNICOMMUART_STAT_IDLE_OFS                (9)                             /* !< IDLE Offset */
#define UNICOMMUART_STAT_IDLE_MASK               ((uint32_t)0x00000200U)         /* !< IDLE mode has been detected in
                                                                                    Idleline-Multiprocessor-Mode. The
                                                                                    IDLE bit is used as an address tag
                                                                                    for each block of characters. In
                                                                                    idle-line multiprocessor format, this
                                                                                    bit is set when a received character
                                                                                    is an address. */
#define UNICOMMUART_STAT_IDLE_CLEARED            ((uint32_t)0x00000000U)         /* !< IDLE has not been detected before
                                                                                    last received character. (In
                                                                                    idle-line multiprocessor mode). */
#define UNICOMMUART_STAT_IDLE_SET                ((uint32_t)0x00000200U)         /* !< IDLE has been detected before last
                                                                                    received character. (In idle-line
                                                                                    multiprocessor mode). */
/* UNICOMMUART_STAT[RXFE] Bits */
#define UNICOMMUART_STAT_RXFE_OFS                (2)                             /* !< RXFE Offset */
#define UNICOMMUART_STAT_RXFE_MASK               ((uint32_t)0x00000004U)         /* !< UART Receive FIFO Empty */
#define UNICOMMUART_STAT_RXFE_CLEARED            ((uint32_t)0x00000000U)         /* !< The receiver is not empty. */
#define UNICOMMUART_STAT_RXFE_SET                ((uint32_t)0x00000004U)         /* !< eceive FIFO is empty. */
/* UNICOMMUART_STAT[RXCLR] Bits */
#define UNICOMMUART_STAT_RXCLR_OFS               (4)                             /* !< RXCLR Offset */
#define UNICOMMUART_STAT_RXCLR_MASK              ((uint32_t)0x00000010U)         /* !< RX FIFO Clear Status */
#define UNICOMMUART_STAT_RXCLR_CLEARED           ((uint32_t)0x00000000U)         /* !< FIFO is not cleared */
#define UNICOMMUART_STAT_RXCLR_SET               ((uint32_t)0x00000010U)         /* !< FIFO clear is complete */
/* UNICOMMUART_STAT[TXCLR] Bits */
#define UNICOMMUART_STAT_TXCLR_OFS               (7)                             /* !< TXCLR Offset */
#define UNICOMMUART_STAT_TXCLR_MASK              ((uint32_t)0x00000080U)         /* !< TX FIFO Clear Status */
#define UNICOMMUART_STAT_TXCLR_CLEARED           ((uint32_t)0x00000000U)         /* !< FIFO is not cleared */
#define UNICOMMUART_STAT_TXCLR_SET               ((uint32_t)0x00000080U)         /* !< FIFO clear is complete */
/* UNICOMMUART_STAT[SENDIDLE] Bits */
#define UNICOMMUART_STAT_SENDIDLE_OFS            (10)                            /* !< SENDIDLE Offset */
#define UNICOMMUART_STAT_SENDIDLE_MASK           ((uint32_t)0x00000400U)         /* !< TX FIFO Clear Status */
#define UNICOMMUART_STAT_SENDIDLE_CLEARED        ((uint32_t)0x00000000U)         /* !< IDLE condition has not yet been
                                                                                    sent on the line */
#define UNICOMMUART_STAT_SENDIDLE_SET            ((uint32_t)0x00000400U)         /* !< IDLE condition has been sent on the
                                                                                    line */

/* UNICOMMUART_IFLS Bits */
/* UNICOMMUART_IFLS[TXIFLSEL] Bits */
#define UNICOMMUART_IFLS_TXIFLSEL_OFS            (0)                             /* !< TXIFLSEL Offset */
#define UNICOMMUART_IFLS_TXIFLSEL_MASK           ((uint32_t)0x00000007U)         /* !< FIFO Level Select for generating
                                                                                    events (interrupt/dma).  Note: for
                                                                                    undefined settings the default
                                                                                    configuration is used. */
#define UNICOMMUART_IFLS_TXIFLSEL_LVL_3_4        ((uint32_t)0x00000001U)         /* !< TX FIFO <= 3/4 empty */
#define UNICOMMUART_IFLS_TXIFLSEL_LVL_1_2        ((uint32_t)0x00000002U)         /* !< TX FIFO <= 1/2 empty (default) */
#define UNICOMMUART_IFLS_TXIFLSEL_LVL_1_4        ((uint32_t)0x00000003U)         /* !< TX FIFO <= 1/4 empty */
#define UNICOMMUART_IFLS_TXIFLSEL_LVL_NOT_FULL   ((uint32_t)0x00000004U)         /* !< Opposite of full */
#define UNICOMMUART_IFLS_TXIFLSEL_LVL_EMPTY      ((uint32_t)0x00000005U)         /* !< TX FIFO is empty */
#define UNICOMMUART_IFLS_TXIFLSEL_LVL_ALMOST_EMPTY ((uint32_t)0x00000006U)         /* !< TX FIFO <= 1 */
#define UNICOMMUART_IFLS_TXIFLSEL_LVL_ALMOST_FULL ((uint32_t)0x00000007U)         /* !< TX_FIFO >= (MAX_FIFO_LEN -1) */
/* UNICOMMUART_IFLS[RXIFLSEL] Bits */
#define UNICOMMUART_IFLS_RXIFLSEL_OFS            (4)                             /* !< RXIFLSEL Offset */
#define UNICOMMUART_IFLS_RXIFLSEL_MASK           ((uint32_t)0x00000070U)         /* !< FIFO Level Select for generating
                                                                                    events (interrupt/dma).  Note: for
                                                                                    undefined settings the default
                                                                                    configuration is used. */
#define UNICOMMUART_IFLS_RXIFLSEL_LVL_1_4        ((uint32_t)0x00000010U)         /* !< RX FIFO >= 1/4 full */
#define UNICOMMUART_IFLS_RXIFLSEL_LVL_1_2        ((uint32_t)0x00000020U)         /* !< RX FIFO >= 1/2 full (default) */
#define UNICOMMUART_IFLS_RXIFLSEL_LVL_3_4        ((uint32_t)0x00000030U)         /* !< RX FIFO >= 3/4 full */
#define UNICOMMUART_IFLS_RXIFLSEL_LVL_NOT_EMPTY  ((uint32_t)0x00000040U)         /* !< Opposite of empty */
#define UNICOMMUART_IFLS_RXIFLSEL_LVL_FULL       ((uint32_t)0x00000050U)         /* !< RX FIFO is full */
#define UNICOMMUART_IFLS_RXIFLSEL_LVL_ALMOST_FULL ((uint32_t)0x00000060U)         /* !< RX_FIFO >= (MAX_FIFO_LEN -1) */
#define UNICOMMUART_IFLS_RXIFLSEL_LVL_ALMOST_EMPTY ((uint32_t)0x00000070U)         /* !< RX_FIFO <= 1 */
/* UNICOMMUART_IFLS[RXTOSEL] Bits */
#define UNICOMMUART_IFLS_RXTOSEL_OFS             (8)                             /* !< RXTOSEL Offset */
#define UNICOMMUART_IFLS_RXTOSEL_MASK            ((uint32_t)0x00000F00U)         /* !< UART Receive Interrupt Timeout
                                                                                    Select. When receiving no start edge
                                                                                    for an additional character within
                                                                                    the set bittimes a RX interrupt is
                                                                                    set even if the FIFO level is not
                                                                                    reached. A value of 0 disables this
                                                                                    function. */
#define UNICOMMUART_IFLS_RXTOSEL_MINIMUM         ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMUART_IFLS_RXTOSEL_MAXIMUM         ((uint32_t)0x00000F00U)         /* !< Highest possible value */
/* UNICOMMUART_IFLS[TXCLR] Bits */
#define UNICOMMUART_IFLS_TXCLR_OFS               (3)                             /* !< TXCLR Offset */
#define UNICOMMUART_IFLS_TXCLR_MASK              ((uint32_t)0x00000008U)         /* !< TX FIFO CLEAR. Setting this bit
                                                                                    will clear the TX FIFO contents. */
#define UNICOMMUART_IFLS_TXCLR_DISABLE           ((uint32_t)0x00000000U)         /* !< Disable FIFO clear */
#define UNICOMMUART_IFLS_TXCLR_ENABLE            ((uint32_t)0x00000008U)         /* !< Enable FIFO Clear */
/* UNICOMMUART_IFLS[RXCLR] Bits */
#define UNICOMMUART_IFLS_RXCLR_OFS               (7)                             /* !< RXCLR Offset */
#define UNICOMMUART_IFLS_RXCLR_MASK              ((uint32_t)0x00000080U)         /* !< RX FIFO CLEAR. Setting this bit
                                                                                    will clear the RX FIFO contents. */
#define UNICOMMUART_IFLS_RXCLR_DISABLE           ((uint32_t)0x00000000U)         /* !< Disable FIFO clear */
#define UNICOMMUART_IFLS_RXCLR_ENABLE            ((uint32_t)0x00000080U)         /* !< Enable FIFO Clear */

/* UNICOMMUART_IBRD Bits */
/* UNICOMMUART_IBRD[DIVINT] Bits */
#define UNICOMMUART_IBRD_DIVINT_OFS              (0)                             /* !< DIVINT Offset */
#define UNICOMMUART_IBRD_DIVINT_MASK             ((uint32_t)0x0000FFFFU)         /* !< Integer Baud-Rate Divisor */
#define UNICOMMUART_IBRD_DIVINT_MINIMUM          ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMUART_IBRD_DIVINT_MAXIMUM          ((uint32_t)0x0000FFFFU)         /* !< Highest possible value */

/* UNICOMMUART_FBRD Bits */
/* UNICOMMUART_FBRD[DIVFRAC] Bits */
#define UNICOMMUART_FBRD_DIVFRAC_OFS             (0)                             /* !< DIVFRAC Offset */
#define UNICOMMUART_FBRD_DIVFRAC_MASK            ((uint32_t)0x0000003FU)         /* !< Fractional Baud-Rate Divisor */
#define UNICOMMUART_FBRD_DIVFRAC_MINIMUM         ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMUART_FBRD_DIVFRAC_MAXIMUM         ((uint32_t)0x0000003FU)         /* !< Highest possible value */

/* UNICOMMUART_GFCTL Bits */
/* UNICOMMUART_GFCTL[DGFSEL] Bits */
#define UNICOMMUART_GFCTL_DGFSEL_OFS             (0)                             /* !< DGFSEL Offset */
#define UNICOMMUART_GFCTL_DGFSEL_MASK            ((uint32_t)0x0000003FU)         /* !< Glitch Suppression Pulse Width
                                                                                    This field controls the pulse width
                                                                                    select for glitch suppression on the
                                                                                    RX line.  The value programmed in
                                                                                    this field gives the number of cycles
                                                                                    of functional clock up to which the
                                                                                    glitch has to be suppressed on the RX
                                                                                    line.  In IRDA mode: The minimum
                                                                                    pulse length for receive is given by:
                                                                                    t(MIN) = (DGFSEL) / f(IRTXCLK) */
#define UNICOMMUART_GFCTL_DGFSEL_DISABLED        ((uint32_t)0x00000000U)         /* !< Bypass GF */
#define UNICOMMUART_GFCTL_DGFSEL_MAXIMUM         ((uint32_t)0x0000003FU)         /* !< Highest Possible Value */

