zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_unicommuart.h
/* UNICOMMUART_IRCTL Bits */
/* UNICOMMUART_IRCTL[IRTXPL] Bits */
#define UNICOMMUART_IRCTL_IRTXPL_OFS             (2)                             /* !< IRTXPL Offset */
#define UNICOMMUART_IRCTL_IRTXPL_MASK            ((uint32_t)0x000000FCU)         /* !< Transmit pulse length. Pulse length
                                                                                    t(PULSE) = (IRTXPLx + 1) / [2 *
                                                                                    f(IRTXCLK)] (IRTXCLK = functional
                                                                                    clock of the UART) */
#define UNICOMMUART_IRCTL_IRTXPL_MINIMUM         ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMUART_IRCTL_IRTXPL_MAXIMUM         ((uint32_t)0x000000FCU)         /* !< Highest possible value */
/* UNICOMMUART_IRCTL[IRRXPL] Bits */
#define UNICOMMUART_IRCTL_IRRXPL_OFS             (9)                             /* !< IRRXPL Offset */
#define UNICOMMUART_IRCTL_IRRXPL_MASK            ((uint32_t)0x00000200U)         /* !< IrDA receive input UCAxRXD polarity */
#define UNICOMMUART_IRCTL_IRRXPL_HIGH            ((uint32_t)0x00000000U)         /* !< IrDA transceiver delivers a high
                                                                                    pulse when a light pulse is seen */
#define UNICOMMUART_IRCTL_IRRXPL_LOW             ((uint32_t)0x00000200U)         /* !< IrDA transceiver delivers a low
                                                                                    pulse when a light pulse is seen */
/* UNICOMMUART_IRCTL[IREN] Bits */
#define UNICOMMUART_IRCTL_IREN_OFS               (0)                             /* !< IREN Offset */
#define UNICOMMUART_IRCTL_IREN_MASK              ((uint32_t)0x00000001U)         /* !< IrDA encoder/decoder enable */
#define UNICOMMUART_IRCTL_IREN_DISABLE           ((uint32_t)0x00000000U)         /* !< IrDA encoder/decoder disabled */
#define UNICOMMUART_IRCTL_IREN_ENABLE            ((uint32_t)0x00000001U)         /* !< IrDA encoder/decoder enabled */
/* UNICOMMUART_IRCTL[IRTXCLK] Bits */
#define UNICOMMUART_IRCTL_IRTXCLK_OFS            (1)                             /* !< IRTXCLK Offset */
#define UNICOMMUART_IRCTL_IRTXCLK_MASK           ((uint32_t)0x00000002U)         /* !< IrDA transmit pulse clock select */
#define UNICOMMUART_IRCTL_IRTXCLK_BITCLK         ((uint32_t)0x00000000U)         /* !< IrDA encode data is based on the
                                                                                    functional clock. */
#define UNICOMMUART_IRCTL_IRTXCLK_BRCLK          ((uint32_t)0x00000002U)         /* !< IrDA encode data is based on the
                                                                                    Baud Rate clock< when select 8x
                                                                                    oversampling, the IRTXPL cycle should
                                                                                    less 8;  when select 16x
                                                                                    oversampling, the IRTXPL cycle should
                                                                                    less 16. */

/* UNICOMMUART_AMASK Bits */
/* UNICOMMUART_AMASK[VALUE] Bits */
#define UNICOMMUART_AMASK_VALUE_OFS              (0)                             /* !< VALUE Offset */
#define UNICOMMUART_AMASK_VALUE_MASK             ((uint32_t)0x000000FFU)         /* !< Self Address Mask for 9-Bit Mode
                                                                                    This field contains the address mask
                                                                                    that creates a set of addresses that
                                                                                    should be matched.  A 0 bit in the
                                                                                    MSK bitfield configures, that the
                                                                                    corresponding bit in the ADDR
                                                                                    bitfield of the UARTxADDR register is
                                                                                    don't care. A 1 bit in the MSK
                                                                                    bitfield configures, that the
                                                                                    corresponding bit in the ADDR
                                                                                    bitfield of the UARTxADDR register
                                                                                    must match. */
#define UNICOMMUART_AMASK_VALUE_MINIMUM          ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMUART_AMASK_VALUE_MAXIMUM          ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* UNICOMMUART_ADDR Bits */
/* UNICOMMUART_ADDR[VALUE] Bits */
#define UNICOMMUART_ADDR_VALUE_OFS               (0)                             /* !< VALUE Offset */
#define UNICOMMUART_ADDR_VALUE_MASK              ((uint32_t)0x000000FFU)         /* !< Self Address for 9-Bit Mode  This
                                                                                    field contains the address that
                                                                                    should be matched when UARTxAMASK is
                                                                                    FFh. */
#define UNICOMMUART_ADDR_VALUE_MINIMUM           ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMUART_ADDR_VALUE_MAXIMUM           ((uint32_t)0x000000FFU)         /* !< Highest possible value */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_unicommuart__include */
